Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge.
///
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through profile curves that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.